#심리테스트
print("만약 누군가가 당신에게 손을 내밀어보라고 했을 때, 당신의 손 모양은?")
print("1.손 등이 위로 오고 손가락 사이를 벌린 사람")
print("2.손 등이 위로 오고 손을 오므린 사람")
print("3.손바닥이 위로 오고 손가락 사이를 벌린 사람")
print("4.손바닥이 위로 오고 손을 오므린 사람")
hand = int(input("번호를 선택하시오"))

if hand == 1:
    print("당신은 감정이 얼굴에 잘 드러나 거짓말을 잘 못하고 좋고 싫음이 분명한 성격입니다.")
    print("하지만 뒤끝이 없기 때문에 당신이 정한 선만 넘지 않는다면 쉽게 용서해주고 넘어가는 쿨한 성격이기도 합니다.")
    print("조금만 기쁜 일이 있어도 잘 웃는 낙천적인 사람이며 남에게 받은 호의는 반드시 되돌려주려 하는 멋진 성격의 소유자 입니다.")
elif hand == 2:
    print("배려심이 강하고 자신을 타인에게 맞추려는 성격의 소유자입니다.")
    print("외관상으로는 열정이 넘치고 친절하지만 내적으로는 안일한 생활을 추구하려는 경향이 있습니다.")
    print("자신과 친한 사람에게만 자신의 진짜 모습과 감정을 드러내며 낯선 사람에게는 착한 사람 코스프레를 하기도 합니다.")
    print("게으른 성향이 있어 될 대로 되라 식으로 현재 처지에 안주하며, 실패를 두려워 하여 도전하는 것을 꺼려합니다.")
elif hand == 3:
    print("당신은 겉으로는 강하고 밝아보이지만 속으로는 누군가 자신을 위로해주고 보듬어주기를 원합니다.")
    print("그래서 슬픈일이 생기면 가장 친한 사람에게만 공유를 하거나 혼자 숨죽여 울기도 합니다.")
    print("친절하고 세심한 성격을 지니고 있어 좋아하는 사람들을 살뜰히 챙기는 타입이며,")
    print("애교를 잘 부리고 밝은 성격탓에 분위기메이커 역할을 하기도 합니다.")
else :
    print("상처받는 것이 두려워 낯선 사람에게는 다소 차갑게 대하지만 한번 친해지면 자신의 성격과 매력을 마음껏 뿜어냅니다.")
    print("친구가 부탁하는 것은 거절을 잘 못하여 사기 당하기 쉬운 성격입니다.")
    print("자존심은 하늘을 찌를듯 높지만 자존감은 매우 낮습니다.")
    print("게으르고 멍때리는 것을 좋아하며 외출하는 것 보다 집이 좋은 집순이 입니다.")
    print("관종끼가 약간 있어서 가끔씩 엽기적인 행동을 하기도 합니다.")
